# -*- coding:utf-8 -*-

# 正面情绪的词典
pos_list = [
        '爱', '棒', '逗', '高', '好', '萌', '牛', '帅', '爽', '松', '赞',

        '保证', '必选', '博学', '不错', '不难', '超好', '称赞', '充实', '大爱',
        '大赞', '从容', '风趣', '分高', '分好', '丰富', '负责', '高分', '好过', '好课',
        '好评', '好人', '好玩', '和蔼', '很多', '很好', '很萌', '很高', '很强',
        '很帅', '很赞', '激情', '加分', '简单', '精彩', '可爱', '课好', '酷酷', '厉害',
        '力挺', '良心', '满分', '蛮好', '魅力', '美丽', '美女', '萌萌', '迷妹',
        '耐心', '男神', '女神', '漂亮', '气质', '清楚', '全面', '强推', '亲切',
        '轻松', '热爱', '人好', '人美', '认真', '容易', '生动', '视频', '实用',
        '收获', '帅帅', '随和', '挺高', '挺强', '挺帅', '推荐', '温柔', '五星',
        '吸引', '喜欢', '细致', '笑话', '潇洒', '详细', '学到', '养眼', '用心',
        '友好', '幽默', '有趣', '有用', '渊博', '赞赞', '值得', '自由',

        '不点名', '不签到', '炒鸡棒', '点名少', '分很高', '分挺高', '好说话',
        '灰常好', '会加分', '没问题', '没作业', '挺不错', '挺好玩', '挺舒服',
        '无点名',
        '五颗星', '无压力', '学问好',
        '颜值高', '有条理', '有意思', '赞赞赞',

        '不用考试', '点名很少', '和蔼可亲', '很少点名', '交口称赞', '开卷考试',
        '蛮有意思', '名不虚传', '强烈推荐', '轻松愉快', '轻松自在', '认真负责',
        '生动活泼', '受益匪浅', '提前下课', '引人入胜', '作业不多',


        '不需要点名', '不选会后悔', '不怎么点名', '管的比较松', '管得比较松',
        '没什么作业',

        '作业几乎没有', '基本没点过名'
        ]

# 负面情绪的词典
neg_list = [
        '多', '挂', '累', '泪', '难', '死', '细', '严', '重', '低', '醉',

        '崩塌', '变态', '别选', '别学', '不高', '不好', '不爽', '点名', '更坑',
        '好低',
        '呵呵', '恨死', '很多', '很坑', '很闷',
        '很严', '坑爹', '枯燥', '零分', '论文', '难受', '批评', '气死', '伤心',
        '慎选', '生硬', '太低',
        '太多', '太重', '讨厌', '挺严', '无聊', '严格', '严苛', '严重', '一般',
        '有毒',

        '不合理', '不科学', '不喜欢', '不要去', '不要选', '不友好', '不尊重',
        '麻烦事', '瞎了眼', '要求高', '作业多',

        '不感兴趣', '大失所望', '怀疑人生', '浪费时间', '四大名捕'

        '点名超级多'
        ]
